{"type":{"desc":"<p>Set the data transformation type to <code class=\"codespan\">sunburst</code>, mainly used for the display of the sunburst chart.</p>\n"},"startAngle":{"desc":"<p>The starting angle of the sunburst chart, the default value is <code class=\"codespan\">Math.PI / 2</code>, which is the 12 o&#39;clock direction.</p>\n"},"endAngle":{"desc":"<p>The starting angle of the sunburst chart, the default value is <code class=\"codespan\">(-3 * Math.PI) / 2</code>.</p>\n"},"center":{"desc":"<p>The position of the center, the default value is <code class=\"codespan\">[&#39;50%&#39;, &#39;50%&#39;]</code>, which is the center of the canvas.\nThe value type is an array of length 2, and the elements of the array support two formats:</p>\n<ul>\n<li><code class=\"codespan\">number</code> Numeric type, specifying the center coordinate.</li>\n<li><code class=\"codespan\">string</code> Percentage string, <code class=\"codespan\">center[0]</code> calculates a coordinate relative to the width of the canvas, and <code class=\"codespan\">center[1]</code> calculates a coordinate relative to the height of the canvas.</li>\n</ul>\n"},"innerRadius":{"desc":"<p>The value corresponding to the minimum inner diameter, supporting three formats:</p>\n<ul>\n<li><code class=\"codespan\">number</code> Numeric type, specifying the size of the inner diameter of the innermost layer, in <code class=\"codespan\">px</code>.</li>\n<li><code class=\"codespan\">string</code> Percentage string, specifying the minimum inner diameter of all levels relative to the minimum value of the canvas width and height, calculating an inner diameter size according to the percentage.</li>\n<li><code class=\"codespan\">Array&lt;number|string&gt;</code> Each element in the array type supports both numeric and percentage types, and the array is used to set the inner diameter size of each level.</li>\n</ul>\n"},"outerRadius":{"desc":"<p>The value corresponding to the maximum outer diameter, supporting three formats:</p>\n<ul>\n<li><code class=\"codespan\">number</code> Numeric type, specifying the size of the inner diameter of the outermost layer, in <code class=\"codespan\">px</code>.</li>\n<li><code class=\"codespan\">string</code> Percentage string, specifying the size of the maximum outer diameter, relative to the minimum value of the canvas-width and height, calculating an outer diameter size according to the percentage.</li>\n<li><code class=\"codespan\">Array&lt;number|string&gt;</code> Each element in the array type supports both numeric and percentage types, and the array is used to set the outer diameter size of each level.</li>\n</ul>\n"},"gapRadius":{"desc":"<p>Set the radial spacing between adjacent levels, supporting two formats:</p>\n<ul>\n<li><code class=\"codespan\">number</code> Numeric type, specifying the radial spacing between adjacent levels, in <code class=\"codespan\">px</code>.</li>\n<li><code class=\"codespan\">number[]</code> Array type, <code class=\"codespan\">gapRadius[i]</code> represents the radial spacing between the <code class=\"codespan\">i</code>th and <code class=\"codespan\">i+1</code>th levels.</li>\n</ul>\n"},"nodeKey":{"desc":"<p>Type: <code class=\"codespan\">string|number</code>\nSet the field corresponding to the globally unique key of the node. If not set, it will be generated internally based on the level information.</p>\n"},"label":{"desc":"<p>Set the text label of the node. If not set, no label-related data will be returned. Supports three formats:</p>\n<ul>\n<li><code class=\"codespan\">boolean</code> Boolean type, sets whether to display a text label, valid for all levels.</li>\n<li><code class=\"codespan\">SunburstLabelOptions</code> Set the text label configuration for all levels, see below for the specific meaning of the configuration.</li>\n<li><code class=\"codespan\">SunburstLabelOptions[]</code> <code class=\"codespan\">label[i]</code> represents the text label configuration for the i-th level.</li>\n</ul>\n<p>The specific type definition for <code class=\"codespan\">SunburstLabelOptions</code> is:</p>\n<pre><code class=\"lang-ts\">interface SunburstLabelConfig {\n  align?: &#39;start&#39; | &#39;end&#39; | &#39;center&#39;;\n  rotate?: &#39;tangential&#39; | &#39;radial&#39;;\n  offset?: number;\n}\n</code></pre>\n<p>The meaning of each parameter is as follows:</p>\n<ul>\n<li><code class=\"codespan\">align</code> represents the alignment of the label, <code class=\"codespan\">start</code> means aligned along the inner diameter direction, <code class=\"codespan\">end</code> means aligned along the outer diameter direction, <code class=\"codespan\">center</code> means aligned along the middle radius.</li>\n<li><code class=\"codespan\">rotate</code> means the rotation of the label, <code class=\"codespan\">tangetial</code> means rotating along the tangent direction, <code class=\"codespan\">radial</code> means rotating along the radial direction.</li>\n<li><code class=\"codespan\">offset</code> represents the offset of the label, in <code class=\"codespan\">px</code>.</li>\n</ul>\n"}}