{"type":{"desc":"<p>Sets the data transformation type to <code class=\"codespan\">tree</code></p>\n"},"direction":{"desc":"<p>Set the alignment of the tree diagram, optional values are:</p>\n<ul>\n<li><code class=\"codespan\">&#39;horizontal&#39;</code> Sets the layout direction to horizontal, from left to right</li>\n<li><code class=\"codespan\">&#39;vertical&#39;</code> Sets the layout direction to vertical, from top to bottom</li>\n<li><code class=\"codespan\">&#39;LR&#39;</code> Sets the layout direction from left to right</li>\n<li><code class=\"codespan\">&#39;RL&#39;</code> Sets the layout direction from right to left</li>\n<li><code class=\"codespan\">&#39;TB&#39;</code> Sets the layout direction from top to bottom</li>\n<li><code class=\"codespan\">&#39;BT&#39;</code> Sets the layout direction from bottom to top</li>\n</ul>\n"},"layoutType":{"desc":"<p>Set the layout type, the default value is <code class=\"codespan\">orthogonal</code>, which means layout in the Cartesian coordinate system; when the value is set to <code class=\"codespan\">radial</code>, it means layout in the polar coordinate system.</p>\n"},"alignType":{"desc":"<p>Set the alignment of the layout, optional values are:</p>\n<ul>\n<li><code class=\"codespan\">&#39;depth&#39;</code> Align according to the depth of the tree</li>\n<li><code class=\"codespan\">&#39;leaf&#39;</code> Align the leaf nodes of the tree</li>\n</ul>\n"},"linkWidth":{"desc":"<p>Type: <code class=\"codespan\">number | number[]</code>\nIs it required: No</p>\n<ul>\n<li>Specify the width of the link, if not specified,</li>\n<li>Compute the depth-most nodes for extents.</li>\n</ul>\n<p>Set the width of tree diagram connections, if vertical layout, it means the height of the connection, supporting two formats:</p>\n<ul>\n<li>number: Set the width of all connections</li>\n<li>number[]: Set the width of connections for each level</li>\n</ul>\n<p>If not set, the maximum depth will be calculated, and then the width of connections for each level will be calculated.</p>\n"},"minNodeGap":{"desc":"<p>Set the minimum spacing between siblings, if not set, it will be automatically calculated based on the width of the node.</p>\n"},"nodeKey":{"desc":"<p>Type: <code class=\"codespan\">string|number</code>\nSets the field corresponding to the globally unique key of the node, if not set, it will be generated internally based on the level information.</p>\n"}}